const data = {
  username: 'kuchorus',
  loginType: 'normal',
  password: '123456',
  displayName: 'ชมรมขับร้องประสานเสียงแห่งมหาวิทยาลัยเกษตรศาสตร์',
  role: 'store',
  avatarURL: 'https://scontent.fbkk2-6.fna.fbcdn.net/v/t1.0-0/p370x247/12240152_970340363043507_4972928624540017244_n.png?_nc_cat=107&_nc_sid=85a577&_nc_oc=AQlaCssMpCJiqOXmJyRD6QxEtnx4QvKG1HXVwl7vOvLQc4PwkwEhPh4biFnQmqDYFsQ&_nc_ht=scontent.fbkk2-6.fna&oh=2c84dd366400b1bab590078ef0d0463c&oe=5EBC2DFC',
  active: true,
  bio: `แรกเริ่มนั้นเกิดจากการรวมกลุ่มของกลุ่มผู้สนใจการขับร้องประสานเสียงโดยมี ผศ.ดร.ธวัชชัย นาควงศ์ (ปัจจุบัน รศ.ดร.ธวัชชัย นาควงษ์) เป็นผู้ริเริ่ม จนมีการก่อตั้งเป็นกลุ่มขับร้องประสานเสียง เมื่อวันที่ 2 กรกฎาคม พ.ศ.2534 ณ ภาควิชาศิลปนิเทศ คณะมนุษยศาสตร์ มีสมาชิก 105 คน จากทุกคณะเพื่อขับร้องเพลงประสานเสียงในพิธีเปิดและปิดงานกีฬามหาวิทยาลัย นนทรีเกมส์ ครั้งที่ 20 ในปี พ.ศ. 2536 โดยนายบุญลือ แซ่จิ้ว ได้ดำรงตำแหน่งเป็นประธานกลุ่มขับร้องประสานเสียงคนแรก ต่อมาจึงจัดตั้งเป็นชมรม โดยมีการนำเรื่องเข้าสภานิสิตแห่งมหาวิทยาลัยเกษตรศาสตร์ และได้รับการอนุมัติให้จัดตั้งเป็น ชมรมขับร้องประสานเสียงแห่งมหาวิทยาลัยเกษตรศาสตร์ (KU CHORUS) และมี นางสาวปิยมาภรณ์ สบายแท้ เป็นประธานชมรมคนแรก`,
  email: 'kuchorus@ku.th',
  firstName: 'KUChorus',
  lastName: 'KUChorus',
  mobilePhone: '0951923921',
  contacts: 'มหาวิทยาลัยเกษตรศาสตร์',
}

module.exports = data;