const mongoose = require('mongoose')
const User = mongoose.model('User')
const Article = mongoose.model('Article')

let user = {
  username: 'speakerku',
  loginType: 'normal',
  password: '123456',
  displayName: 'ชมรมส่งเสริมศิลปะการพูด มหาวิทยาลัยเกษตรศาสตร์',
  role: 'store',
  avatarURL: 'https://scontent.fbkk2-3.fna.fbcdn.net/v/t31.0-0/p370x247/22829861_1472624022791105_872139398843287739_o.jpg?_nc_cat=109&_nc_sid=85a577&_nc_oc=AQlFMtqmknJFkxc3FQm9-ZL5I5UXhIOoIWT94L6KtNsMeSM9RxXv1h1LTTzEQmdN6Uo&_nc_ht=scontent.fbkk2-3.fna&_nc_tp=6&oh=a50e695c8c5c7156e72b1cc40bc973bd&oe=5EBEA142',
  active: true,
  bio: `องค์กรนี้ไม่ได้สร้างขึ้นมาเพื่อหาผลประโยชน์ให้ฝ่ายใดฝ่ายหนึ่ง
  หรือการเมืองทั้งสิ้น
  แต่สร้างขึ้นเพื่อความบันเทิง และอัพเดทข่าวสารให้กลุ่มนิสิติาสาสมัคร
  มหาวิทยาลัยเกษตรศาสตร์ หรือ
  ชมรมค่ายอาสาพัฒนามหาวิทยาลัยเกษตรศาสตร์ ได้รู้
  หากรูปใดหรือข้อความใด้ไม่เหมาะสม ก็ขออภัยเป็นอย่างสูง`,
  email: 'speakerku@ku.th',
  firstName: 'SpeakerKU',
  lastName: 'SpeakerKU',
  mobilePhone: '0951923921',
  contacts: 'มหาวิทยาลัยเกษตรศาสตร์',
}

let articles = [
  {
      title: 'ฟังอบรมจากวิทยากร ณฐ เตชธรรมวณิช หรือ ครูดอย',
      description: `
      วิทยากรคนที่ 3 : ณฐ เตชธรรมวณิช หรือ ครูดอย

      อีกหนึ่งความสำคัญในการเป็นนักพูดที่ดี คือ “บุคลิกภาพ” และ “ความมั่นใจ” ในปีนี้ครูดอยจะขนเอาเคล็ดลับการสร้างบุคลิกภาพที่ดีมาให้ทุกคนแน่นอน🙋🏻‍♂️

      และมาพบกันที่โครงการอบรมการพูด ครั้งที่ 40 #แค่speakชีวิตก็spark จ้าาา

      📍สมัครเข้าร่วมอบรมได้ที่👇🏼
      https://docs.google.com/…/1FAIpQLSfDpxL_MkcQS9gF7…/viewform…

      📍ค่าสมัครเพียงแค่ 300 บาทเท่านั้น! (ฟรีอาหารกลางวันและของว่างทั้ง 2 วัน) ชำระค่าสมัครได้ที่
      ✔️ชมรมส่งเสริมศิลปะการพูด ชั้น 3 อาคารเทพศาสตร์สถิตย์ หรือ
      ✔️โอนชำระได้ที่เลขบัญชี 010-1-29388-2 ธนาคารกสิกรไทย (ปุณณวิช ทุมพานิช) และส่งหลักฐานการโอนมาได้ที่ inbox ทางเพจชมรมส่งเสริมศิลปะการพูด มหาวิทยาลัยเกษตรศาสตร์หรือ Line ID : punnw

      **ขออนุญาตสงวนสิทธิ์เฉพาะนิสิตปัจจุบันมหาวิทยาลัยเกษตรศาสตร์**
      📍สอบถามข้อมูลเพิ่มเติม : 0939687796 (ปุณ) / 0910050665 (ไบรท์)

      🔜แล้วมาเจอกันนะ วันที่ 22-23 กุมภาพันธ์ เวลา 8.00 - 17.30 น.(ไม่ค้างคืน)อาคารเทพศาสตร์สถิตย์ ชั้น 2
      #แค่speakชีวิตก็spark ฟี้ววว💨
      `,
      articleType: 'news',
      newsType: 'club',
      imageURL: 'https://scontent.fbkk2-6.fna.fbcdn.net/v/t1.0-9/84020766_2780888188631342_3324963981763805184_n.jpg?_nc_cat=104&_nc_sid=110474&_nc_oc=AQlpklEXhFh7RzDqm13qE7Yl5MnakcXTlbUM58V3z72GfefGyOAr_LNz6IzLA27taos&_nc_ht=scontent.fbkk2-6.fna&oh=f4ea0a879032df56e6f70d17359b3746&oe=5EBF0105',
      author: '5e9818e846871726ac3a79e5',
      tags: ['ทั่วไป']
  },
  {
    title: 'โครงการอบรมการพูดในที่ชุมชน ครั้งที่ 40🎤',
    description: `
    โครงการอบรมการพูดในที่ชุมชน ครั้งที่ 40🎤
    “Public Speaking Training 40th”
    #แค่speakชีวิตก็spark 🔥
    
    ✔️งัดเทคนิคปลุกความมั่นใจ
    ✔️เสริมทักษะการพูด
    ✔️ปรับปรุงบุคลิกภาพ
    
    พบกับวิทยากรสุดพิเศษทั้งหมด 4 ท่าน ได้แก่
    
    👉🏼คุณจ๋า (VJ JA) ณัฐฐาวีรนุช ทองมี - ร่วมแชร์ประสบการณ์ดีๆ ที่จะนำไปสู่ความสำเร็จ🔆
    
    👉🏼ครูทีน่า ชนดา ธนาลาภสกุล - งัดเทคนิคการใช้ภาษาอังกฤษในงานพิธีกรและงานต่างๆ🎤
    
    👉🏼ครูดอย ณฐ เตชธรรมวณิช - เสริมสร้างบุคลิกภาพที่มั่นใจและทัศนคติเชิงบวกสู่ความสำเร็จ🧍🏻🧍🏻‍♀️
    
    👉🏼พี่ไกด์ รัฐรุจน์ สกุลวัชรอนันต์ - ปลุกเสน่ห์ในการพูด เพื่อสร้างสรรค์เวทีของเรา🎤
    
    📍สมัครเข้าอบรมได้ที่
    https://docs.google.com/…/1FAIpQLSfDpxL_MkcQS9gF7…/viewform… หรือ สามารถแสกนคิวอาร์โค้ดในโพสได้เลย สมัครได้ตั้งแต่วันนี้ - 18 กุมภาพันธ์ ช้าหมดอดน้า🔜
    
    📍ค่าสมัครเพียงแค่ 300 บาทเท่านั้น! (ฟรีอาหารกลางวันและของว่างทั้ง 2 วัน) ชำระค่าสมัครได้ที่
    ✔️ชมรมส่งเสริมศิลปะการพูด ชั้น 3 อาคารเทพศาสตร์สถิตย์ หรือ
    ✔️โอนชำระได้ที่เลขบัญชี 010-1-29388-2 ธนาคารกสิกรไทย (ปุณณวิช ทุมพานิช) และส่งหลักฐานการโอนมาได้ที่ inbox ทางเพจชมรมส่งเสริมศิลปะการพูด มหาวิทยาลัยเกษตรศาสตร์หรือ Line ID : punnw
    
    **ขออนุญาตสงวนสิทธิ์เฉพาะนิสิตปัจจุบันมหาวิทยาลัยเกษตรศาสตร์**
    🔥สอบถามข้อมูลเพิ่มเติม : 0939687796 (ปุณ)/0910050665 (ไบรท์)
    
    🔜แล้วมาเจอกันนะ วันที่ 22-23 กุมภาพันธ์ เวลา 8.00 - 17.30 น.(ไม่ค้างคืน)อาคารเทพศาสตร์สถิตย์ ชั้น 2 ฟี้ววว💨
    `,
    articleType: 'news',
    newsType: 'club',
    imageURL: 'https://scontent.fbkk2-4.fna.fbcdn.net/v/t1.0-9/83679548_2771042466282581_6567382050762915840_n.jpg?_nc_cat=101&_nc_sid=110474&_nc_oc=AQnJx9ZBdEpic1dQGWMC1CU6WOTW7bpvxQpVqHf4NyQ38ZWZIVzFcazZAdlgKYpLVpQ&_nc_ht=scontent.fbkk2-4.fna&oh=6db30b5610fdbd5b4d28429437b1b472&oe=5EBEF8FA',
    author: '5e9818e846871726ac3a79e5',
    tags: ['ทั่วไป']
  }
]

const insertMany = async () => {
  const createdUser = new User(user)
  await createdUser.setPassword(user.password)
  await createdUser.save()
  for (const article of articles) {
    const createdArticle = new Article(article)
    createdArticle.author = createdUser
    await createdArticle.save()
  }
}

module.exports = insertMany