const News = require('../models/news')
const mongoose = require('mongoose')

const arr = [
    {
        title: 'ตามหาของหาย',
        description: "📢 ตามหาของหาย📍เป็นกระเป๋าสีดำตรงกลางเป็นลายนกอินทรีกับธงอเมริกา📢ตามหาเจ้าของใครพบเห็นหรือเป็นเจ้าของสามารถติดต่อรับได้ที่เพจนะงับ",
        type: 'lost-founds',
        user: mongoose.Types.ObjectId('5e32a25f3e65ba7204144321'),
        imageURL: [
            'https://scontent-sin2-1.xx.fbcdn.net/v/t1.0-9/83644354_2993917483971956_1455108991167234048_o.jpg?_nc_cat=100&_nc_ohc=GIu4QWC60mQAX99i_FX&_nc_ht=scontent-sin2-1.xx&oh=bb9fc0513c41cfb02e1235745544c217&oe=5ED3E61D',
            'https://scontent-sin2-1.xx.fbcdn.net/v/t1.0-9/83885353_2993917553971949_88965681986404352_o.jpg?_nc_cat=102&_nc_ohc=XejRAeTB-IcAX8Y0HE0&_nc_ht=scontent-sin2-1.xx&oh=3a455cfcc73e179ece9a0b855c381fcb&oe=5EC103B2'
        ],
        views: 0,
        comments: [
            mongoose.Types.ObjectId('5e32a40c116c4772710e5134'),
            mongoose.Types.ObjectId('5e32a40c116c4772710e5135')
        ]
    },
    {
        title: 'KUPhototrip2020',
        description: 'สิ้นสุดการรอคอย!!!! #KUPhototrip2020 กลับมาแล้วววว วันที่ 15-16 กุมภาพันธ์นี้คราวนี้พวกเราขอพาน้องๆไปออกทริปถ่ายรูปกันที่ “จังหวัดเพชรบุรี”ไปดื่มด่ำกับศิลปะทางธรรมชาติกันที่ โครงการพระราชดำริแหลมผักเบี้ย ที่ไม่ได้เป็นเพียงเส้นทางศึกษาธรรมชาติตามรอยพระราชดำริเท่านั้น ยังมีมุมสวยๆซ่อนอยู่ และ special cafe ที่ชิคที่สุดในเพชรบุรี แต่ขออุบไว้ก่อนว่าเป็นที่ไหน รับรองถ่ายรูปสะใจแน่นอน!!!!!พร้อมกับที่พักที่แสนสบาย ชายหาดส่วนตัว และทั้งหมดนี้ทั้งทริปราคา 550 บาท!!!!สนใจสมัครตามลิงค์นี้เลย https://forms.gle/NyaawqPyYeWoPjZr5สามารถสมัครได้ตั้งแต่วันนี้จนถึงวันที่ 8 กุมภาพันธ์!พลาดทริปนี้แล้วคุณจะเสียใจ!!!!!!!',
        type: 'club',
        user: mongoose.Types.ObjectId('5e32a25f3e65ba720414431f'),
        imageURL: [
            'https://scontent-sin2-1.xx.fbcdn.net/v/t1.0-9/82603683_2948267068572268_3008415305681600512_n.jpg?_nc_cat=103&_nc_ohc=aCKFL01jrWkAX8OhXcY&_nc_ht=scontent-sin2-1.xx&oh=ba9d17304e8adb68d5810a5d3f14805e&oe=5ED67204',
            'https://scontent-sin2-1.xx.fbcdn.net/v/t1.0-9/84291101_2948267165238925_5328199259047067648_n.jpg?_nc_cat=108&_nc_ohc=3-_CF8pRFAgAX8W7UFi&_nc_ht=scontent-sin2-1.xx&oh=bf74c1665256c2e799084cf4a801ae7d&oe=5ED3909C'
        ],
        views: 0,
        comments: []
    },
    {
        title: 'งานประชุมวิชาการ',
        description: 'ในงานเกษตรแฟร์ ก็มี งานประชุมวิชาการขอเชิญผู้สนใจเข้าร่วมการประชุมทางวิชาการของมหาวิทยาลัยเกษตรศาสตร์ ครั้งที่ 58 (ไม่เสียค่าใช้จ่าย)นำเสนอผลงานใหม่จากนักวิจัยทั่วประเทศ แบ่งเป็น 12 สาขามีทั้งภาคโปสเตอร์ ภาคบรรยาย และการบรรยาย เสวนา อภิปรายพิเศษที่อยู่ในประเด็นร้อนทางสังคม จำนวนกว่า 298 เรื่อง5 – 7 กุมภาพันธ์นี้พบกัน ที่มหาวิทยาลัยเกษตรศาสตร์ติดตามรายละเอียดได้ที่ http://annualconference.ku.ac.th/#ประชุมทางวิชาการ58',
        type: 'universities',
        imageURL: [
            'https://scontent-sin2-1.xx.fbcdn.net/v/t1.0-0/p640x640/84042388_10158068469827451_1183099911923564544_o.jpg?_nc_cat=101&_nc_ohc=WqxawoRIIIsAX9D0SGQ&_nc_ht=scontent-sin2-1.xx&_nc_tp=6&oh=3c783213069519fc6e9726a3e85b06f7&oe=5E91D346'
        ],
        user: mongoose.Types.ObjectId('5e32a25f3e65ba7204144321'),
        views: 0,
        comments: []
    },
    {
        title: 'ขอเชิญร่วมรับฟังและแลกเปลี่ยนความคิดเห็นในการประชุมวิชาการเพื่อประชาชน',
        description: 'คณะประมง มหาวิทยาลัยเกษตรศาสตร์ ร่วมกับมหาวิทยาลัยเกียวโต และกรมประมงขอเชิญร่วมรับฟังและแลกเปลี่ยนความคิดเห็นในการประชุมวิชาการเพื่อประชาชน เรื่อง ปัญหาปลาต่างถิ่นในประเทศไทย—เราจะคบกับปลาต่างถิ่นอย่างไร?วันศุกร์ที่ 31 มกราคม 2563 เวลา 9:30–16:35 น.ห้อง 303 ตึกบุญอินทรัมพรรย์ คณะประมง มก.(ไม่เสียค่าใช้จ่าย)** ปลาต่างถิ่น ใคร? นำมา** ผลกระทบต่อระบบนิเวศที่คาดไม่ถึง** ใคร? ควรดูแล ใคร? ควรบริหารจัดการและ กฎหมายมีหรือไม่** ความรู้ที่ถูกต้องเกี่ยวกับปลาต่างถิ่น **ไม่ซื้อ ** ไม่ปล่อยลงธรรมชาติ **ไม่เลี้ยง **ไม่บริโภค',
        type: 'universities',
        imageURL: [
            'https://scontent-sin2-1.xx.fbcdn.net/v/t1.0-9/83697100_2958410204211295_7075535136384614400_n.jpg?_nc_cat=110&_nc_ohc=WM__nVPBYnkAX_s8UWS&_nc_ht=scontent-sin2-1.xx&oh=9053c285d99379d173a025b202517f1e&oe=5EC77D51'
        ],
        user: mongoose.Types.ObjectId('5e32a25f3e65ba7204144321'),
        views: 0,
        comments: []
    },
    {
        title: 'โปรโมชั่น4จ่าย3',
        description: 'วันนี้พี่หมีใจดี๊ใจดีแจกแก้วน้ำให้ลูกค้าที่แวะมาทานที่ร้านของเราจร้า โปรโมชั่นเดือนนี้ เอาใจสายกินจุ👇🏻**ช่วงกลางวันมีโปร 4 จ่าย 3** ถึงสิ้นเดือนนี้เท่านั้น!!!!เรียกกันมากินฟินทั้งแก๊ง',
        type: 'promotions',
        imageURL: [
            'https://scontent-sin2-1.xx.fbcdn.net/v/t1.0-9/77388826_1496956390454444_6510195188281901056_n.jpg?_nc_cat=109&_nc_ohc=RzlZvOZV_sgAX8KBX6U&_nc_ht=scontent-sin2-1.xx&oh=04bfcdbc3d1ed27af171c9f3a498b094&oe=5ED1CCE8'
        ],
        user: mongoose.Types.ObjectId('5e32a25f3e65ba7204144322'),
        views: 0,
        comments: []
    },
    {
        title: 'โครงการค่ายอาสาทำดีเพื่อพ่อ ครั้งที่ 13',
        description: 'ไฟนอลเสร็จแล้วเราไปค่ายด้วยกันไหม? ใครอยากไปยกมือขึ้นน🖐️มาคราวนี้ ชมรมค่ายอาสาขอเสนอ🔸🔶"โครงการค่ายอาสาทำดีเพื่อพ่อ ครั้งที่ 13"🔶🔸มาร่วมสร้างลานอเนกประสงค์ ลาน BBL ปรับปรุงแปลงผัก ให้กับโรงเรียนในถิ่นทุรกันดารไปกับชมรมค่ายอาสาด้วยกันนะ🤗📆วันที่ 1-7 ธ.ค. 62ณ โรงเรียนบ้านคลองเจ้าแรง อ.กบินทร์บุรี จ.ปราจีนบุรี(ตรงนี้มีใครทายถูกบ้างไหมน้าา🤔)☑️น้องๆ คนไหนที่สนใจสามารถเข้ามากรอกใบสมัครพร้อมสัมภาษณ์ได้ที่ชมรมค่ายอาสาพัฒนา (หน้าตึก 8 ตรงฝั่งตรงข้ามสนามรักบี้)📆ในวันที่ 21-25 ต.ค. 62 17:00-19:00 น. (ยกเว้นวันที่ 23 ต.ค. 62)📌Meeting: 28 ต.ค. 62 เวลา 17:00-19:00 น.💥สำหรับนิสิตวิทยาเขตศรีราชาทางเราจะแจ้งกำหนดการให้ทราบในภายหลัง💥⚠️⚠️⚠️งานนี้รับเฉพาะ KU78 และ KU79 เท่านั้น⚠️⚠️⚠️ขอบอกเลยว่า"ฟรี" ไม่มีค่าใช้จ่าย แถมยังได้เพื่อนต่างวิทยาเขตด้วยนะ😘',
        type: 'club',
        imageURL: [
            'https://scontent-sin2-1.xx.fbcdn.net/v/t1.0-9/72239473_2510913405665342_3571193288612380672_o.jpg?_nc_cat=108&_nc_ohc=hcsoxTGbwjEAX9YECqw&_nc_ht=scontent-sin2-1.xx&oh=ed40377a825da984fdd8f33f246607b8&oe=5EC78B02'
        ],
        user: mongoose.Types.ObjectId('5e32a25f3e65ba7204144320'),
        views: 0,
        comments: []
    }
]
News.insertMany(arr, function (err, news) {
    if (err) return console.error(err)
    console.log(" saved to collection.")
})

