let data = [
  {
      title: 'ชมรม KU Chorus ได้รับรางวัลรองชนะเลิศอันดับ 2',
      description: `
      ชมรม KU Chorus ได้รับรางวัลรองชนะเลิศอันดับ 2 และได้รับรางวัลสนับสนุนให้กับทางมหาวิทยาลัยเกษตรศาสตร์ ในการแข่งขัน GSB GEN WAY-T ณ ลานอัฒจันทร์ Siam Square One

      ขอบคุณทุกฝ่ายที่ให้การสนับสนุน และขอบคุณทุกกำลังใจ
      
      ชมรม KU Chorus จะนำข้อเสนอแนะต่างๆไปปรับใช้ และพัฒนาชมรมให้ดียิ่งขึ้น
      `,
      articleType: 'news',
      newsType: 'club',
      imageURL: 'https://scontent.fbkk2-8.fna.fbcdn.net/v/t1.0-9/s960x960/78302523_2535346046542923_5120116571821309952_o.jpg?_nc_cat=103&_nc_sid=9e2e56&_nc_oc=AQkRN4uUI07EXtwl3wb4wFaxD3DObInWGlSgbMi2L3oNjxjQQqy1jSveOqF6q2vnRKM&_nc_ht=scontent.fbkk2-8.fna&_nc_tp=7&oh=9bbb04776d99eecb4faa093ac28ac770&oe=5EBD28AF',
      author: '5e981d00eaa56028e5d6fe58',
      tags: ['ทั่วไป']
  },
  {
    title: 'เปิดรับสมัคร ออดิชั่นตำแหน่ง "นักเปียโน" และ "นักร้องชาย" ',
    description: `
    ประกาศจากชมรม KU Chorus 🎉🎉🎉
    เปิดรับสมัคร ออดิชั่นตำแหน่ง "นักเปียโน" และ "นักร้องชาย" สำหรับใครที่สนใจจะมาเป็นส่วนหนึ่งไปกับพวกเราชาว KU Chorus สามารถทักเข้ามาทางเพจเพื่อลงชื่อสมัครได้เลยครับ
    โดยบอกชื่อ คณะ ชั้นปี รหัสนิสิต และตำแหน่งที่จะมาสมัคร ไว้ทาง inbox ได้เลยครับ เปิดรับสมัครทางเพจตั้งแต่วันนี้ เป็นต้นไป แล้วพบกันนะครับ 😁😁😁
    `,
    articleType: 'news',
    newsType: 'club',
    imageURL: 'https://scontent.fbkk2-6.fna.fbcdn.net/v/t1.0-9/s960x960/70394258_2376257965785066_3926305990714064896_o.jpg?_nc_cat=107&_nc_sid=110474&_nc_oc=AQkdVut1I3vBuI5JXTUR6PFjFAG7qsZ55x1flB4fYgHtUehRdu3smMPR5kNFUmAoiac&_nc_ht=scontent.fbkk2-6.fna&_nc_tp=7&oh=108c26f4303dcb5cba01830d9e3fcb92&oe=5EBC54D0',
    author: '5e981d00eaa56028e5d6fe58',
    tags: ['ทั่วไป']
  }
]

module.exports = data;