let data = [
    {
        title: 'ONE DAY TRIP ระเบิกศักยภาพ',
        description: `
          มาช่วยโลกกันเถอะ ! 🎯
          .
          .
          ช่วยโลกแบบชิว ๆ
          แพ็คลูกอม + เขียนกำลังใจ
          แจกให้ทุกคนที่เราเดินผ่าน
          พร้อมให้ความรู้โควิด
          .
          .
          วันเสาร์ 14 มีนาคม 63
          9.00-12.00 แพ็คลูกอม+เขียนกำลังใจ
          12.00-12.30 แจกลูกอม + ไปวัดพระศรีฯ
          12.30-13.30 รับประทานอาหารเที่ยง
          13.30-14.30 แจกลูกอม + ให้อาหารปลา
          .
          .
          เพียงแค่ 5 ชั่วโมงครึ่ง
          สร้างพลังบวกให้สังคม ❤
          .
          .
          #รับจำนวน20คน^^
          #มาเป็นผู้ให้กันเถอะะะ
          .
          .
          สมัครเล้ยยยย
          https://docs.google.com/forms/d/e/1FAIpQLSfLwClGmUpoHtps2xhNwzINPRcn-uI0xwhTlT684S5_sCFoug/viewform
          .
          .
          .
          เจอกันที่ห้องชมรมพัฒนาศักยภาพ
          @ ตึกมัลติมีเดีย ชั้น 3
          .
          สอบถามข้อมูล : KU potential club
          หรือ พี่มังกร : 081-4368614
        `,
        articleType: 'news',
        newsType: 'club',
        imageURL: 'https://scontent.fbkk2-7.fna.fbcdn.net/v/t1.0-9/p720x720/87365310_2311847532250981_5065639971143024640_o.jpg?_nc_cat=108&_nc_sid=110474&_nc_oc=AQnypoFFhnBcUC9pOgTg8Ntsf06MP-MVUpRLs7Y8fUGX6TUIAivs0dGhd-loaJGasn8&_nc_ht=scontent.fbkk2-7.fna&_nc_tp=6&oh=a8bdc248e24f075565a87e55a1265446&oe=5EBD368C',
        author: '5e9814f6f2300524bf542f1c',
        tags: ['พัฒนาตัวเอง', 'จิตอาสา']
    },
    {
      title: 'รวมพลคนนั่งสมาธิ พิชิตไฟนอลตัวร้าย',
      description: `
        เพิ่มพลังก่อนสอบไฟนอล ด้วยการนั่งสมาธิยาว 1 ชั่วโมง
        .
        แล้วเจอกันที่ห้องชมรม วันที่ 32 ธันวาคม 2563 เริ่มนั่ง 18.00 น.
        .
        พบกับวิทยากรสุดพิเศษ ส่งตรงมาจากวัดธรรมกาย !!!
      `,
      articleType: 'news',
      newsType: 'club',
      imageURL: 'https://scontent.fbkk2-8.fna.fbcdn.net/v/t1.0-9/84346910_2232643480171387_247239238343458816_n.jpg?_nc_cat=100&_nc_sid=85a577&_nc_oc=AQnU8l690Jq5muk7o4B4hQEQ2c159Y0s0MEkuegRnSMb87B6p-anQ0UqatDv20XA-is&_nc_ht=scontent.fbkk2-8.fna&oh=04c455da260fbcedb6d89bb2a0b1e257&oe=5EBC9989',
      author: '5e9814f6f2300524bf542f1c',
      tags: ['พัฒนาตัวเอง', 'นั่งสมาธิ']
    }
]

module.exports = data;