let data = [
  {
      title: 'ฟังอบรมจากวิทยากร ณฐ เตชธรรมวณิช หรือ ครูดอย',
      description: `
      วิทยากรคนที่ 3 : ณฐ เตชธรรมวณิช หรือ ครูดอย

      อีกหนึ่งความสำคัญในการเป็นนักพูดที่ดี คือ “บุคลิกภาพ” และ “ความมั่นใจ” ในปีนี้ครูดอยจะขนเอาเคล็ดลับการสร้างบุคลิกภาพที่ดีมาให้ทุกคนแน่นอน🙋🏻‍♂️

      และมาพบกันที่โครงการอบรมการพูด ครั้งที่ 40 #แค่speakชีวิตก็spark จ้าาา

      📍สมัครเข้าร่วมอบรมได้ที่👇🏼
      https://docs.google.com/…/1FAIpQLSfDpxL_MkcQS9gF7…/viewform…

      📍ค่าสมัครเพียงแค่ 300 บาทเท่านั้น! (ฟรีอาหารกลางวันและของว่างทั้ง 2 วัน) ชำระค่าสมัครได้ที่
      ✔️ชมรมส่งเสริมศิลปะการพูด ชั้น 3 อาคารเทพศาสตร์สถิตย์ หรือ
      ✔️โอนชำระได้ที่เลขบัญชี 010-1-29388-2 ธนาคารกสิกรไทย (ปุณณวิช ทุมพานิช) และส่งหลักฐานการโอนมาได้ที่ inbox ทางเพจชมรมส่งเสริมศิลปะการพูด มหาวิทยาลัยเกษตรศาสตร์หรือ Line ID : punnw

      **ขออนุญาตสงวนสิทธิ์เฉพาะนิสิตปัจจุบันมหาวิทยาลัยเกษตรศาสตร์**
      📍สอบถามข้อมูลเพิ่มเติม : 0939687796 (ปุณ) / 0910050665 (ไบรท์)

      🔜แล้วมาเจอกันนะ วันที่ 22-23 กุมภาพันธ์ เวลา 8.00 - 17.30 น.(ไม่ค้างคืน)อาคารเทพศาสตร์สถิตย์ ชั้น 2
      #แค่speakชีวิตก็spark ฟี้ววว💨
      `,
      articleType: 'news',
      newsType: 'club',
      imageURL: 'https://scontent.fbkk2-6.fna.fbcdn.net/v/t1.0-9/84020766_2780888188631342_3324963981763805184_n.jpg?_nc_cat=104&_nc_sid=110474&_nc_oc=AQlpklEXhFh7RzDqm13qE7Yl5MnakcXTlbUM58V3z72GfefGyOAr_LNz6IzLA27taos&_nc_ht=scontent.fbkk2-6.fna&oh=f4ea0a879032df56e6f70d17359b3746&oe=5EBF0105',
      author: '5e9818e846871726ac3a79e5',
      tags: ['ทั่วไป']
  },
  {
    title: 'โครงการอบรมการพูดในที่ชุมชน ครั้งที่ 40🎤',
    description: `
    โครงการอบรมการพูดในที่ชุมชน ครั้งที่ 40🎤
    “Public Speaking Training 40th”
    #แค่speakชีวิตก็spark 🔥
    
    ✔️งัดเทคนิคปลุกความมั่นใจ
    ✔️เสริมทักษะการพูด
    ✔️ปรับปรุงบุคลิกภาพ
    
    พบกับวิทยากรสุดพิเศษทั้งหมด 4 ท่าน ได้แก่
    
    👉🏼คุณจ๋า (VJ JA) ณัฐฐาวีรนุช ทองมี - ร่วมแชร์ประสบการณ์ดีๆ ที่จะนำไปสู่ความสำเร็จ🔆
    
    👉🏼ครูทีน่า ชนดา ธนาลาภสกุล - งัดเทคนิคการใช้ภาษาอังกฤษในงานพิธีกรและงานต่างๆ🎤
    
    👉🏼ครูดอย ณฐ เตชธรรมวณิช - เสริมสร้างบุคลิกภาพที่มั่นใจและทัศนคติเชิงบวกสู่ความสำเร็จ🧍🏻🧍🏻‍♀️
    
    👉🏼พี่ไกด์ รัฐรุจน์ สกุลวัชรอนันต์ - ปลุกเสน่ห์ในการพูด เพื่อสร้างสรรค์เวทีของเรา🎤
    
    📍สมัครเข้าอบรมได้ที่
    https://docs.google.com/…/1FAIpQLSfDpxL_MkcQS9gF7…/viewform… หรือ สามารถแสกนคิวอาร์โค้ดในโพสได้เลย สมัครได้ตั้งแต่วันนี้ - 18 กุมภาพันธ์ ช้าหมดอดน้า🔜
    
    📍ค่าสมัครเพียงแค่ 300 บาทเท่านั้น! (ฟรีอาหารกลางวันและของว่างทั้ง 2 วัน) ชำระค่าสมัครได้ที่
    ✔️ชมรมส่งเสริมศิลปะการพูด ชั้น 3 อาคารเทพศาสตร์สถิตย์ หรือ
    ✔️โอนชำระได้ที่เลขบัญชี 010-1-29388-2 ธนาคารกสิกรไทย (ปุณณวิช ทุมพานิช) และส่งหลักฐานการโอนมาได้ที่ inbox ทางเพจชมรมส่งเสริมศิลปะการพูด มหาวิทยาลัยเกษตรศาสตร์หรือ Line ID : punnw
    
    **ขออนุญาตสงวนสิทธิ์เฉพาะนิสิตปัจจุบันมหาวิทยาลัยเกษตรศาสตร์**
    🔥สอบถามข้อมูลเพิ่มเติม : 0939687796 (ปุณ)/0910050665 (ไบรท์)
    
    🔜แล้วมาเจอกันนะ วันที่ 22-23 กุมภาพันธ์ เวลา 8.00 - 17.30 น.(ไม่ค้างคืน)อาคารเทพศาสตร์สถิตย์ ชั้น 2 ฟี้ววว💨
    `,
    articleType: 'news',
    newsType: 'club',
    imageURL: 'https://scontent.fbkk2-4.fna.fbcdn.net/v/t1.0-9/83679548_2771042466282581_6567382050762915840_n.jpg?_nc_cat=101&_nc_sid=110474&_nc_oc=AQnJx9ZBdEpic1dQGWMC1CU6WOTW7bpvxQpVqHf4NyQ38ZWZIVzFcazZAdlgKYpLVpQ&_nc_ht=scontent.fbkk2-4.fna&oh=6db30b5610fdbd5b4d28429437b1b472&oe=5EBEF8FA',
    author: '5e9818e846871726ac3a79e5',
    tags: ['ทั่วไป']
  }
]

module.exports = data;